/**
 * !Замикання
 * Функція результатом своєї роботи може повертати іншу функцію
 *
 * - Функцію яку повернули під час виклику буде мати доступ до всіх локальних змінних(області видимості)
 * батьківської функції(тої із якої її повернули)
 * це називається замиканням
 */

const fnA = function (parameter) {
  const innerVariable = 'Значення внутрішньої змінної функції fnA';
  const innerFunction = function () {
    console.log('Це виклик функції innerFunction');
  };
  return innerFunction;
};

// результатом роботи функції fnA повертаю функцію innerFunction
